import 'package:flutter/material.dart';

class AppColors {
  static const Color white = Colors.white;

  static const Color black = Colors.black;

  static const Color primaryGreen = Color(0xFF006B3F);
}

final List<String> names = [
  'طارق عبدالعزيز العيسى',
  'سارة أحمد المالك',
  'محمد خالد العتيبي',
  'الطفل: عبدالله ناصر',
  'مجهول الهوية',
  'نورة فهد الدوسري'
];

final List<String> cities = [
  'الرياض',
  'جدة',
  'مكة المكرمة',
  'المدينة المنورة',
  'الدمام',
  'الخبر',
  'الطائف',
  'تبوك',
  'بريدة',
  'أبها',
  'حائل',
  'جازان',
  'نجران',
  'الجبيل',
];

final List<String> family = [
  'أب',
  'أم',
  'أخ',
  'أخت',
  'ابن',
  'ابنة',
  'زوج',
  'زوجة',
  'جد',
  'جدة',
  'عم',
  'عمة',
  'خال',
  'خالة',
  'صديق',
  'جار',
  'أخرى',
];

final List<String> descriptions = [
  'خرج من المنزل مرتدياً ثوب أبيض وشماغ أحمر، آخر تواجد له كان بالقرب من المسجد.',
  'فقدت في السوق التجاري، ترتدي عباية رأس وحقيبة يد بنية.',
  'شاب يرتدي بدلة رياضة زرقاء، يعاني من طيف التوحد.',
  'طفل صغير عمره 5 سنوات، ضاع بالقرب من الحديقة العامة.',
  'رجل مسن وجد تائهاً في الشارع العام، لا يحمل إثبات.',
  'خرجت من المدرسة ولم تعد، ترتدي الزي المدرسي.'
];

final List<String> locations = [
  'حي الياسمين',
  'حي الملقا',
  'حي النرجس',
  'حي العقيق',
  'حي العليا',
  'حي السويدي'
];

final List<String> times = [
  'منذ 10 د',
  'منذ ساعة',
  'منذ 3 ساعات',
  'منذ أمس',
  'قبل قليل',
  'منذ يومين'
];

final List<String> distances = [
  '800 م',
  '2 كم',
  '5 كم',
  '12 كم',
  '15 كم',
  '20 كم'
];
